#define _CRT_SECURE_NO_WARNINGS


//#include <stdio.h>
//
//void test(void)
//{
//	printf("1");
//}
////第一个void表示无返回值
////第二个表示无参数
//
//int main()
//{
//	test(1);//就算强行传参也可以被调用，但是有警告
//	return 0;
//}



//int main()
//{
//	int a = 20;
//	//原、反、补：00000000 00000000 00000000 00010100
//	//	十六进制	  00       00       00       14  （0x 00 00 00 14）
//
//	int b = -10;
//	//最高位为符号位
//	//原：10000000 00000000 00000000 00001010
//	// 0x 80       00		00		 0a
//	//反：11111111 11111111 11111111 11110101
//	// 0x ff		ff		ff		 f5
//	//补：11111111 11111111 11111111 11110110
//	// 0x ff		ff		ff		 f6
//	//对补码取反：
//	//	  10000000 00000000 00000000 00001001
//	// +1：
//	//	  10000000 00000000 00000000 00001010 得到原码
//
//	//20-10 = 20 + （-10）
//	int c = a + b;
//	//00000000 00000000 00000000 00010100
//	//11111111 11111111 11111111 11110110
//	//相加得到一个补码：
//	//（1）00000000 00000000 00000000 00001010 最高位被丢掉
//	//0x 00 00 00 0a  (10)
//	return 0;
//}



//#include <stdio.h>
//
//int main()
//{
//	int arr[10];
//	printf("%d", (int)sizeof(arr));
//}



//判断当前环境是大端还是小端
#include <stdio.h>
//int check()
//{
//	int i = 1;
//	return (*(char*)&i);
//	//将地址强制转为char*，即只读取最低位的数据
//	//当为小端，得到1；当为大端，得到0
//}

int check();

int main()
{
	int ret = check();
	if (ret == 1)
	{
		printf("小端\n");
	}
	else
	{ 
		printf("大端\n");
	}
	return 0;
}


int check()
{
	union
	{
		int i;
		char c;
	}un;
	un.i = 1;
	return un.c;
}