#define _CRT_SECURE_NO_WARNINGS


#include <stdio.h>

int main()
{
    int n = 9;
    //00000000 00000000 00000000 00001001
    //0 00000000 00000000000000000001001
    //s=0 E=00000000

    float* pFloat = (float*)&n;

    printf("n的值为：%d\n", n);//9
    printf("*pFloat的值为：%f\n", *pFloat);//0.000000
    //0 00000000 0000000000 0000000001 001
    //s=0 E=00000000
    //一个接近0的很小的数


    *pFloat = 9.0;
    //9.0 --- 1001.0
    //s=0 E=3 --- 00000011
    // 3 + 127 = 130 --- 1000 0010
    //0 10000010 0010000000 0000000000 000
    printf("num的值为：%d\n", n);//1，091，567,616

    //01000001 00010000 00000000 00000000
    printf("*pFloat的值为：%f\n", *pFloat);//9.000000
    return 0;
}