#define _CRT_SECURE_NO_WARNINGS


//#include <stdio.h>
//
//int main()
//{
//	int n = 9;//开辟4bytes
//	float* pFloat = (float*)&n;//把n的地址放到pfloat里面，实际还是指向那整形的4bytes
//
//	printf("n的值为：%d\n", n);//9
//	printf("*pFloat的值为：%f\n", *pFloat);//0.000000
//	//这里按照浮点的规则取出数据，结果错误，说明整形和浮点的存储方式不同
//
//	*pFloat = 9.0;
//	printf("num的值为：%d\n", n);//9
//	printf("*pFloat的值为：%f\n", *pFloat);//9.000000
//	return 0;
//}


//int main()
//{
//	float f = 5.5f;
//	//5.5 = 101.1B
//	//1.011*2^2
//	//s=0, m=1.011, e=2
//	//0 1000000 1 01100000000000000000000
//	//01000000 10110000 00000000 00000000
//	//0x 40    b0       00       00
//	return 0;
//}



int main()
{
	char a = -1;
	//此时a为 10000001
	//求补码：11111111
	char b = 4;
	//b：00000100

	//此时对a，b进行调用
	char c = 0;
	c = a + b;
	//发生整形提升
	//		  a：11111111 11111111 11111111 11111111
	//		  b：00000000 00000000 00000000 00000100
	//	相加：(1)00000000 00000000 00000000 00000011
	//    0x       00       00       00       03
	 
	return 0;
}